gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
#define VERSION 162 // version 162 : unicast vers récepteur ESP8266
/*
// Contrôleur interactif ESP32 avec capteurs Sharp IR
// Utilise ESP-NOW pour transmettre les données DMX
// Fréquence d'émission : 50Hz
// Canal DMX 102 : valeur du capteur Sharp IR (0-255)
*/

#include <Arduino.h>
#include <esp_now.h>
#include <WiFi.h>
#include <ESP32Encoder.h>
#include <Wire.h>
#include <TM1637Display.h>
#include <driver/adc.h>  // Pour les constantes ADC de l'ESP32
#include <FastLED.h>     // Pour le ruban WS2812B

#define CONTROL_TEST 0 // 1 pour tester les entrées, 0 pour le fonctionnement normal

// Définitions pour les capteurs Sharp IR
#define DIST_SENSOR_1_PIN 35    // GPIO35 - Premier capteur Sharp IR (changé pour plus de stabilité)
#define DIST_SENSOR_2_PIN 36    // GPIO36 - Deuxième capteur Sharp IR

// Définitions pour les faders analogiques
#define FADER_1_PIN 32    // GPIO32 - Premier fader
#define FADER_2_PIN 33    // GPIO33 - Deuxième fader (changé pour éviter le conflit)
#define FADER_3_PIN 34    // GPIO34 - Troisième fader

// Définitions pour l'encodeur rotatif KY-040
#define ENCODER_A_PIN 26    // GPIO26 - Pin A de l'encodeur
#define ENCODER_B_PIN 27    // GPIO27 - Pin B de l'encodeur
#define ENCODER_BUTTON_PIN 25  // GPIO25 - Bouton de l'encodeur

// Définitions pour l'afficheur TM1637
#define TM1637_CLK_PIN 18    // GPIO18 - CLK de l'afficheur
#define TM1637_DIO_PIN 19    // GPIO19 - DIO de l'afficheur

// Définitions pour les boutons push (remplacement du PCF8574)
#define BUTTON_1_PIN 22    // GPIO22 - Premier bouton (libéré du PCF8574)
#define BUTTON_2_PIN 21    // GPIO21 - Deuxième bouton (libéré du PCF8574)
#define BUTTON_3_PIN 23    // GPIO23 - Troisième bouton (nouveau GPIO)

// Définitions pour le ruban WS2812B
#define LED_STRIP_PIN 4    // GPIO4 - Signal DATA du WS2812B
#define NUM_LEDS 144         // Nombre de LEDs dans le ruban (ajustable)
#define BRIGHTNESS 64      // Luminosité (0-255)

// Configuration ESP-NOW
#define EMISSION_FREQUENCY 50  // Hz (20ms entre chaque émission)
#define DMX_CHANNEL_IR_1 102  // Canal DMX pour le premier capteur Sharp IR
#define DMX_CHANNEL_IR_2 103  // Canal DMX pour le deuxième capteur Sharp IR
#define MAX_DISTANCE_CM 80  // Distance maximale en cm pour Sharp IR (80cm = 0, 4cm = 255)
#define MIN_DISTANCE_CM 4   // Distance minimale en cm pour Sharp IR

// Configuration des presets
#define PRESET_SIZE 40  // Nombre de paramètres par preset (40 au lieu de 38)
#define MAX_PRESETS 10  // Nombre maximum de presets

// Configuration des trigs
#define TRIG_LENGTH 5   // Durée des trigs en nombre de paquets DMX

// Configuration du dimmer RGB
#define DIMMER_SPEED 0.01 // Vitesse de l'inertie du dimmer (0.0-1.0, plus petit = plus lent)

// Structure pour un paramètre
typedef struct {
  const char* name;     // Nom du paramètre
  uint16_t dmxChannel;  // Canal DMX (1-512)
  uint8_t value;        // Valeur actuelle (0-255)
  uint8_t defaultValue; // Valeur par défaut
} Parameter;

// Structure pour un preset complet
typedef struct {
  char name[16];        // Nom du preset
  uint8_t values[PRESET_SIZE]; // Valeurs des paramètres
} Preset;

// Création des objets
TM1637Display display(TM1637_CLK_PIN, TM1637_DIO_PIN);
ESP32Encoder encoder;

// Définition du tableau de LEDs pour FastLED
CRGB leds[NUM_LEDS];

// Définition des 37 paramètres du theremin (24 existants + 13 nouveaux)
Parameter parameters[PRESET_SIZE] = {
  // Paramètres existants (1-24)
  {"autopan_depth", 101, 0, 0},
  {"pitch", 102, 0, 0},
  {"vibrato_speed", 103, 0, 0},
  {"vibrato_depth", 104, 0, 0},
  {"delay_time", 105, 0, 0},
  {"delay_feedback", 106, 0, 0},
  {"osc_waveform", 107, 0, 0},
  {"gate_threshold", 108, 0, 0},
  {"portamento_time", 109, 0, 0},
  {"scale", 110, 0, 0},
  {"octave_low_high", 111, 0, 0},
  {"osc2_volume", 112, 0, 0},
  {"osc2_pitch_offset", 113, 0, 0},
  {"autopan_frequency", 114, 0, 0},
  {"scale_tonic", 115, 0, 0},
  {"volume_drums", 116, 0, 0},
  {"trig_kick", 117, 0, 0},
  {"trig_snare", 118, 0, 0},
  {"trig_hh", 119, 0, 0},
  {"master_volume", 120, 0, 0},
  {"filter_on_off", 121, 0, 0},
  {"filter_cutoff", 122, 0, 0},
  {"filter_reso", 123, 0, 0},
  {"filter_type", 124, 0, 0},
  
  // Nouveaux paramètres (25-37)
  {"ir1_target_param", 125, 1, 1},        // 1 - index du paramètre contrôlé par IR1 (1 = pitch)
  {"ir2_target_param", 126, 3, 3},        // 2 - index du paramètre contrôlé par IR2 (3 = vibrato_depth)
  {"fader1_target_param", 127, 2, 2},     // 3 - index du paramètre contrôlé par fader1 (2 = vibrato_speed)
  {"fader2_target_param", 128, 4, 4},     // 4 - index du paramètre contrôlé par fader2 (4 = delay_time)
  {"fader3_target_param", 129, 5, 5},     // 5 - index du paramètre contrôlé par fader3 (5 = delay_feedback)
  {"button3_target_param", 130, 18, 18},  // 6 - index du paramètre contrôlé par bouton3 (18 = trig_hh)
  {"button3_released_value", 131, 0, 0},  // 7 - valeur quand bouton3 est relevé
  {"button3_pressed_value", 132, 5, 5},   // 8 - valeur quand bouton3 est pressé
  {"rgb1_red", 133, 255, 255},            // 9 - première valeur RGB (rouge)
  {"rgb1_green", 134, 0, 0},              // 10 - première valeur RGB (vert)
  {"rgb1_blue", 135, 0, 0},               // 11 - première valeur RGB (bleu)
  {"rgb2_red", 136, 0, 0},                // 12 - deuxième valeur RGB (rouge)
  {"rgb2_green", 137, 255, 255},          // 13 - deuxième valeur RGB (vert)
  {"rgb2_blue", 138, 0, 0},               // 14 - deuxième valeur RGB (bleu)
  {"dimmer1_source", 139, 0, 0},          // 15 - source du dimmer1 (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)
  {"dimmer2_source", 140, 1, 1}           // 16 - source du dimmer2 (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)
};

// Tableau des presets
Preset presets[MAX_PRESETS];

// Tableau des valeurs DMX (512 canaux)
uint8_t dmxValues[512];

// Structure pour les paquets DMX
typedef struct struct_dmx_packet
{
  uint8_t blockNumber; // on divise les 512 adresses en 4 blocs de 128 adresses
  uint8_t dmxvalues[128];
} struct_dmx_packet;

// Structure pour les données de retour du Ksoloti
typedef struct struct_ksoloti_feedback
{
  uint8_t startByte;    // 0xCC pour identifier les paquets de retour
  uint8_t val1;         // Première valeur du Ksoloti
  uint8_t val2;         // Deuxième valeur du Ksoloti
  uint8_t checksum;     // Checksum pour validation
} struct_ksoloti_feedback;

